Revit 2027 API
LoadBase.IsValidReference Method
 Indicates if the provided reference can host a load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidReference(
	Document doc,
	Reference reference,
	LoadType type,
	bool isConstrainedOnHost
)
Public Shared Function IsValidReference (
	doc As Document,
	reference As Reference,
	type As LoadType,
	isConstrainedOnHost As Boolean
) As Boolean
public:
static bool IsValidReference(
	Document^ doc,
	Reference^ reference,
	LoadType type,
	bool isConstrainedOnHost
)
static member IsValidReference :
        doc : Document *
        reference : Reference *
        type : LoadType *
        isConstrainedOnHost : bool -> bool
Parameters
doc Document
 The document containing both the host and the load.
reference Reference
 A reference to a analytical element.
type LoadType
 The type of the load that is about to be hosted.
isConstrainedOnHost Boolean
 A value indicating if the load is constrained on host or not.
Return Value
Boolean
 True if a load can be placed on the input host.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace